&НаКлиенте
Перем Компонента;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Компонента=БуферО_БуферОбменаКлиент.КомпонентаРаботыСБуферомОбмена();
	Сообщить(БуферО_БуферОбменаКлиент.ВерсияКомпоненты(Компонента));
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзБуфера(Команда)
	ДанныеКартинки=БуферО_БуферОбменаКлиент.ПолучитьКартинкуИзБуфера(Компонента, "ДвоичныеДанные");
	АдресКартинки=ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуфер(Команда)
	БуферО_БуферОбменаКлиент.ОчиститьБуфер(Компонента);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстВБуфере(Команда)
	БуферО_БуферОбменаКлиент.КопироватьСтрокуВБуфер(ТекстБуфера, Компонента);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстИзБуфера(Команда)
	ТекстБуфера=БуферО_БуферОбменаКлиент.ПолучитьТекстИзБуфера(Компонента);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКартинкуВБуфер(Команда)
	БуферО_БуферОбменаКлиент.КопироватьКартинкуВБуфер(АдресКартинки, Компонента);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартнкуИзФайла(Команда)
	ДВФ=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.МножественныйВыбор=Ложь;
	Если ДВФ.Выбрать() Тогда
		Картинка=Новый Картинка(ДВФ.ПолноеИмяФайла);
		КК=Картинка.Преобразовать(ФорматКартинки.PNG);
		АдресКартинки=ПоместитьВоВременноеХранилище(КК.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры