
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить(БуферО_БуферОбменаКлиент.ВерсияКомпоненты());
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзБуфера(Команда)
	ДанныеКартинки=БуферО_БуферОбменаКлиент.КартинкаИзБуфера("ДвоичныеДанные");
	АдресКартинки=ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуфер(Команда)
	БуферО_БуферОбменаКлиент.ОчиститьБуфер();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстВБуфере(Команда)
	БуферО_БуферОбменаКлиент.КопироватьСтрокуВБуфер(ТекстБуфера);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстИзБуфера(Команда)
	ТекстБуфера=БуферО_БуферОбменаКлиент.ТекстИзБуфера();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКартинкуВБуфер(Команда)
	БуферО_БуферОбменаКлиент.КопироватьКартинкуВБуфер(АдресКартинки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартнкуИзФайла(Команда)
	ДВФ=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.МножественныйВыбор=Ложь;
	Если ДВФ.Выбрать() Тогда
		Картинка=Новый Картинка(ДВФ.ПолноеИмяФайла);
		КК=Картинка.Преобразовать(ФорматКартинки.PNG);
		АдресКартинки=ПоместитьВоВременноеХранилище(КК.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФорматБуфераОбмена(Команда)
	Формат=БуферО_БуферОбменаКлиент.ФорматБуфераОбмена();
КонецПроцедуры
