&НаКлиенте
Процедура ПриОткрытии(Отказ)
	БуферО_БуферОбменаКлиент.НачатьПолучениеВерсииКомпоненты(Новый ОписаниеОповещения("ПриОткрытииЗавершение",
		ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ВерсияКомпоненты=Результат;
КонецПроцедуры

&НаКлиенте
Процедура КартинкаИзБуфера(Команда)
	ДанныеКартинки=БуферО_БуферОбменаКлиент.КартинкаИзБуфера("ДвоичныеДанные");
	АдресКартинки=ПоместитьВоВременноеХранилище(ДанныеКартинки, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуфер(Команда)
	БуферО_БуферОбменаКлиент.НачатьОчисткуБуфераОбмена(Новый ОписаниеОповещения("ОчиститьБуферЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуферЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстВБуфере(Команда)
	БуферО_БуферОбменаКлиент.КопироватьСтрокуВБуфер(ТекстБуфера);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстИзБуфера(Команда)
	ТекстБуфера=БуферО_БуферОбменаКлиент.ТекстИзБуфера();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКартинкуВБуфер(Команда)
	БуферО_БуферОбменаКлиент.НачатьКопированиеКартинкиВБуфер(АдресКартинки,Новый ОписаниеОповещения("СкопироватьКартинкуВБуферЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКартинкуВБуферЗавершение(Результат, ПараметрыВызова,ДополнительныеПараметры) Экспорт
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьКартнкуИзФайла(Команда)
	ДВФ=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВФ.МножественныйВыбор=Ложь;
	Если ДВФ.Выбрать() Тогда
		Картинка=Новый Картинка(ДВФ.ПолноеИмяФайла);
		КК=Картинка.Преобразовать(ФорматКартинки.PNG);
		АдресКартинки=ПоместитьВоВременноеХранилище(КК.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФорматБуфераОбмена(Команда)
	Формат=БуферО_БуферОбменаКлиент.ФорматБуфераОбмена();
КонецПроцедуры